Revit 2026 API

# FailureDefinition Properties

---

The FailureDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Severity | The severity of the failure. |

#### Reference

FailureDefinition Class

Autodesk.Revit.DB Namespace